SpenceKonde/megaTinyCore/megaavr/variants/txy7/pins_arduino.h
#if MEGATINYCORE_SERIES != 2
  #define PIN_A0       (A0)
#endif
#define PIN_A1         (A1)
#define PIN_A2         (A2)
#define PIN_A3         (A3)
#define PIN_A4         (A4)
#define PIN_A5         (A5)
#define PIN_A6         (A6)
#define PIN_A7         (A7)
#define PIN_A8         (A8)
#define PIN_A9         (A9)
#define PIN_A10        (A10)
#define PIN_A11        (A11)
#if MEGATINYCORE_SERIES == 2
  #define PIN_A12      (A12)
  #define PIN_A13      (A13)
  #define PIN_A14      (A14)
  #define PIN_A15      (A15)
#endif

#if MEGATINYCORE_SERIES != 2
  static const uint8_t  A0  = PIN_PA0;
#endif
static const uint8_t    A1  = PIN_PA1;
static const uint8_t    A2  = PIN_PA2;
static const uint8_t    A3  = PIN_PA3;
static const uint8_t    A4  = PIN_PA4;
static const uint8_t    A5  = PIN_PA5;
static const uint8_t    A6  = PIN_PA6;
static const uint8_t    A7  = PIN_PA7;
static const uint8_t    A8  = PIN_PB5;
static const uint8_t    A9  = PIN_PB4;
static const uint8_t    A10 = PIN_PB1;
static const uint8_t    A11 = PIN_PB0;
#if MEGATINYCORE_SERIES == 2
  static const uint8_t  A12 = PIN_PC0;
  static const uint8_t  A13 = PIN_PC1;
  static const uint8_t  A14 = PIN_PC2;
  static const uint8_t  A15 = PIN_PC3;
#endif

/* Not Recommended to use the AINn constants */
#if MEGATINYCORE_SERIES != 2
  #define AIN0             NOT_A_PIN
#endif
#define AIN1               ADC_CH(1)
#define AIN2               ADC_CH(2)
#define AIN3               ADC_CH(3)
#define AIN4               ADC_CH(4)
#define AIN5               ADC_CH(5)
#define AIN6               ADC_CH(6)
#define AIN7               ADC_CH(7)
#define AIN8               ADC_CH(8)
#define AIN9               ADC_CH(9)
#define AIN10              ADC_CH(10)
#define AIN11              ADC_CH(11)
#if MEGATINYCORE_SERIES == 2
  #define AIN12              ADC_CH(12)
  #define AIN13              ADC_CH(13)
  #define AIN14              ADC_CH(14)
  #define AIN15              ADC_CH(15)
#endif

/*
            ####  ### #   #      ##  ####  ####   ##  #   #  ###
            #   #  #  ##  #     #  # #   # #   # #  #  # #  #
            ####   #  # # #     #### ####  ####  ####   #    ###
            #      #  #  ##     #  # # #   # #   #  #   #       #
            #     ### #   #     #  # #  #  #  #  #  #   #    ###
*/

#if defined(ARDUINO_MAIN)
// ATtiny1617 / ARDUINO
//                              (MOSI) (UPDI)
//                              (AIN1) (AIN0)
//                                PA1   PA0   PC5   PC4   PC3   PC2
//                                18    21    17    16    15    14
//                             ______________________________________
//                            |*  24    23    22    21    20    19   |
//                            |                                      |
//        (MISO)(AIN2) PA2 19 | 1                                  18| 13  PC1 (PWM on 1-series only)
//                            |                                      |
// (EXTCLK)(SCK)(AIN3) PA3 20~| 2                                  17| 12  PC0 (PWM on 1-series only)
//                            |                                      |
//                       GND  | 3                                  16| 11~ PB0 (AIN11)(SCL)
//                            |                                      |
//                       VDD  | 4                                  15| 10~ PB1 (AIN10)(SDA)
//                            |                                      |
//      (nSS)  (AIN4) PA4  0~ | 5                                  14|  9~ PB2 (TOSC2)(TXD)
//                            |                                      |
//             (AIN5) PA5  1~ | 6                                  13|  8  PB3 (TOSC1)(RXD)
//                            |    7     8     9    10    11    12   |
//                            |______________________________________|
//                                 2     3     4     5     6     7
//                                PA6   PA7   PB7   PB6   PB5   PB4
//                              (AIN6) (AIN7)           (AIN8) (AIN9)
//                               (DAC)

/*  0/1-series. ADC1, TCB1 and AC1, AC2 present only on 16/32k 1-series. TCD0, DAC0, alternate SPI/I2C pins and AC0 inputs past 0 only available on 1-series.

  PIN#   DESC         Pin Name  Other/Sp  ADC0      ADC1      PTC       AC0       AC1       AC2       DAC0      USART0    SPI0      TWI0      TCA(PWM)  TCBn      TCD0      CCL
  0                   PA4                 AIN4      AIN0      X0/Y0                                              XDIR      SS                  WO4                WOA        LUT0-OUT
  1                   PA5       VREFA     AIN5      AIN1      X1/Y1     OUT       AINN0                                                        WO5       TCB0 WO  WOB
  2      DAC          PA6                 AIN6      AIN2      X2/Y2     AINN0     AINP1     AINP0     OUT
  3      LED          PA7                 AIN7      AIN3      X3/Y3     AINP0     AINP0     AINN0                                                                            LUT1-OUT
  4                   PB7
  5                   PB6
  6                   PB5       CLKOUT    AIN8                          AINP1               AINP2                                             *WO2
  7                   PB4                 AIN9                          AINN1     AINP3                                                       *WO1                          *LUT0-OUT
  8      RX           PB3       TOSC1                                             OUT                            RxD                          *WO0
  9      TX           PB2    TOSC2/EVOUT1                                                   OUT                  TxD                           WO2
  10     SDA          PB1                 AIN10               X4/Y4     AINP2                                    XCK                SDA        WO1
  11     SCL          PB0                 AIN11               X5/Y5               AINP2     AINP1                XDIR               SCL        WO0
  12                  PC0                           AIN6                                                                  *SCK                          *TCB0 WO  WOC
  13                  PC1                           AIN7                                                                  *MISO                                   WOD       *LUT1-OUT
  14                  PC2       EVOUT2              AIN8                                                                  *MOSI
  15                  PC3                           AIN9                                                                  *SS                 *WO3                           LUT1-IN0
  16                  PC4                           AIN10                                                                                     *WO4      *TCB1 WO             LUT1-IN1
  17                  PC5                           AIN11                                                                                     *WO5                           LUT1-IN2
  21     UPDI         PA0     RESET/UPDI  AIN0                                                                                                                               LUT0-IN0
  18     MOSI         PA1                 AIN1                                                                  *TxD       MOSI     *SDA                                     LUT0-IN1
  19     MISO         PA2       EVOUT0    AIN2                                                                  *RxD       MISO     *SCL                                     LUT0-IN2
  20     SCK          PA3       EXTCLK    AIN3                                                                  *XCK       SCK                 WO3       TCB1 WO
      * alternative pin locations


  2-series
  PIN#   DESC         Pin Name  Other/Sp  ADC0      AC0       USART     SPI0      TWI0      TCA(PWM)  TCBn      CCL
  0      SS           PA4                 AIN4              *XDIR/XDIR1 SS                   WO4                 LUT0-OUT
  1                   PA5       VREFA     AIN5      OUT                                      WO5      TCB0 WO   *LUT3-OUT
  2                   PA6                 AIN6      AINN0
  3      LED          PA7      *EVOUTA    AIN7      AINP0                                                        LUT1-OUT
  4                   PB7      *EVOUTB
  5                   PB6                           AINP3                                                       *LUT2-OUT
  6                   PB5       CLKOUT    AIN8      AINP1                                   *WO2
  7      Alt Reset    PB4      *RESET     AIN9      AINN1                                   *WO1                *LUT0-OUT
  8      RX           PB3       TOSC1                          RxD                          *WO0
  9      TX           PB2   TOSC2/EVOUTB                       TxD                           WO2                 LUT2-IN2
  10     SDA          PB1                 AIN10     AINP2      XCK                 SDA       WO1                 LUT2-IN1
  11     SCL          PB0                 AIN11     AINN2      XDIR                SCL       WO0                 LUT2-IN0
  12                  PC0                                     *TxD1     *SCK                          *TCB0 WO   LUT3-IN0
  13                  PC1                                     *RxD1     *MISO                                   *LUT1-OUT/LUT3-IN1
  14                  PC2       EVOUTC                        *XCK1     *MOSI                                    LUT3-IN2
  15                  PC3                                     *XDIR1    *SS                 *WO3                 LUT1-IN0
  16                  PC4                                                                   *WO4      *TCB1 WO   LUT1-IN1/LUT3-OUT
  17                  PC5                                                                   *WO5                 LUT1-IN2
  21     UPDI         PA0       RESET/UPDI                                                                       LUT0-IN0
  18     MOSI         PA1                 AIN1                *TxD/TXD1 MOSI      *SDA                           LUT0-IN1
  19     MISO         PA2       EVOUTA    AIN2                *RxD/RxD1 MISO      *SCL                           LUT0-IN2
  20     SCK          PA3       EXTCLK    AIN3                *XCK/XCK1 SCK                 WO3       TCB1 WO
     * alternative pin locations
*/

const uint8_t digital_pin_to_port[] = {
  // Left side, top to bottom
  PA, // 0  PA4
  PA, // 1  PA5
  PA, // 2  PA6
  PA, // 3  PA7
  PB, // 4  PB7
  PB, // 5  PB6
  PB, // 6  PB5
  PB, // 7  PB4
  PB, // 8  PB3
  PB, // 9  PB2
  PB, // 10 PB1
  PB, // 11 PB0
  PC, // 12 PC0
  PC, // 13 PC1
  PC, // 14 PC2
  PC, // 15 PC3
  PC, // 16 PC4
  PC, // 17 PC5 // skip PA0 until the end
  PA, // 18 PA1
  PA, // 19 PA2
  PA, // 20 PA3
  PA  // 21 PA0 UPDI/RST
};

